

var i = 0;



var arrA = ["Автомеханик", "Егерь", "Кондитер", "Пасечник", "Радиооператор", "Астроном", "Бактериолог", "Зоолог", "Минеролог", "Гувернантка", "Священник", "Консультант по профориентации", "Финансовый контролер", "Шифровальщик", "Директор магазина", "Горный инженер", "Животновод", "Маляр", "Охотовед", "Электротехник", "Биолог", "Вирусолог", "Генетик", "Гидробиолог", "Воспитатель детского сада", "Инструктор по плаванию", "Медицинская сестра", "Наборщик типографии", "Переписчик нот", "Начальник стройки", "Машинист тепловоза", "Портной", "Рулевой-моторист", "Штукатур", "Садовник", "Редактор научного журнала", "Физик-теоретик", "Ихтиолог", "Ученый-теоретик", "Преподаватель ин. яз.", "Тренер по лечебной физкультуре", "Социальный работник", "Продюсер телевидения"];
var arrB = ["Авиаконструктор", "Интервьюер", "Делопроизводитель", "Администратор", "Актер", "Гид-экскурсовод", "Корректор текстов",
            "Брокер", "Актер цирка", "Работник архива", "Глава администрации", "Драматург", "Директор", "Искусствовед", "Композитор",
            "Биофизик", "Репетитор", "Составитель каталогов", "Директор рынка", "Карикатурист", "Семейный врач", "Контролер-кассир",
            "Менеджер", "Писатель", "Чертежник", "Начальник отдела сбыта", "Манекенщица", "Оптовый торговец", "Музыкальный аранжировщик", "Музыкант-исполнитель", "Инженер-исследователь", "Консультант службы знакомств", "Регистратор", "Предприниматель", "Танцор",
            "Учитель", "Копировальщик чертежей", "Президент банка", "Художник по интерьеру", "Контролер качества продукции", "Снабженец",
            "Художник-мультипликатор", "Режиссер"];
numberQ.innerHTML = i + 1 + " из 43";
getVariantA.value = arrA[i];
getVariantB.value = arrB[i];
var answer = new Array();



var j = 0;
var realType = ["Автомеханик", "Егерь", "Кондитер", "Пасечник", "Радиооператор", "6", "7", "8", "9", 
            "10", "11", "12", "13", "14", "15",
           "Горный инженер", "Животновод", "Маляр", "Охотовед", "Электротехник", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "Машинист тепловоза", "Портной", "Рулевой-моторист", "Штукатур", "Садовник"];
var rt = 0;
var intType = ["Авиаконструктор", "2", "3", "4", "5", "Астроном", "Бактериолог", "Зоолог", "Минеролог", "10", "11", "12", "13", "14", "15", "Горный инженер", "17", "18", "19", "20", "Биолог", "Вирусолог", "Генетик", "Гидробиолог", "25", "26", "27", "28", "29", "30", "Машинист тепловоза", "32", "33", "34", "35", "Редактор научного журнала", "Физик-теоретик", "Ихтиолог", "Ученый-теоретик"];
var it = 0;
var socType = ["1", "Интервьюер", "3", "4", "5", "Гид-экскурсовод", "7", "8", "9", "Гувернантка", "Священник", "Консультант по профориентации", "13", "14", 15, 16, "Репетитор", 18, 19, 20, "Семейный врач", 22, 23, 24, "Воспитатель детского сада", "Инструктор по плаванию", "Медицинская сестра", 28, 29, 30, 31, "Портной", 33, 34, 35, "Учитель", 37, 38, 39, "Преподаватель ин. яз.", "Тренер по лечебной физкультуре", "Социальный работник"];
var st = 0;
var konType = [1, 2, "Делопроизводитель", 4, 5, 6, "Корректор текстов", 8, 9, "Работник архива", 11, 12, "Финансовый контролер", "Шифровальщик", 15, 16, 17, "Составитель каталогов", 19, 20, 21, "Контролер-кассир", 23, 24, "Чертежник", 26, 27, "Наборщик типографии", "Переписчик нот", 30, 31, 32, "Регистратор", 34, 35, 36, "Копировальщик чертежей", 38, 39, "Контролер качества продукции", 41, 42, "Продюсер"];
var kt = 0;
var predType = [1, 2, 3, "Администратор", 5, 6, 7, "Брокер", 9, 10, "Глава администрации", 12, "Директор", 14, "Директор", 16, 17, 18, "Директор рынка", 20, 21, 22, "Менеджер", 24, 25, "Начальник отдела сбыта", 27, "Оптовый торговец", 29, "Начальник стройки", 31, 32, 33, "Предприниматель", 35, 36, 37, "Президент банка", 39, 40, "Снабженец", 42, "Режиссер"];
var pt = 0;
var artType = [1, 2, 3, 4, "Актер", 6, 7, 8, "Актер цирка", 10, 11, "Драматург", 13, "Искусствовед", "Композитор", 16, 17, 18, 19, "Карикатурист", 21, 22, 23, "Писатель", 25, 26, "Манекенщица", 28, "Музыкальный аранжировщик", "Музыкант-исполнитель", 31, 32, 33, 34, "Танцор", 36, 37, 38, "Художник по интерьеру", 40, 41, "Художник-мультипликатор", 43];
var at = 0;


function selVariantA() {
    answer[i] = arrA[i];
    i = i + 1;
    getVariantA.value = arrA[i];
    getVariantB.value = arrB[i];

    
    if(i>42){
        document.getElementById('testID').style.display='none';
        document.getElementById('infoID').style.display='block';
    }
    
    numberQ.innerHTML = i + 1 + " из 43";
}

function selVariantB() {
    answer[i] = arrB[i];
    i = i + 1;

    getVariantA.value = arrA[i];
    getVariantB.value = arrB[i];

    
    if(i>42){
        document.getElementById('testID').style.display='none';
        document.getElementById('infoID').style.display='block';
    }
    
    numberQ.innerHTML = i + 1 + " из 43";
}

function back(){
    i--;
    
    if( i < 0 ){
        window.location.href="pretest.html";
    }
    else{
    numberQ.innerHTML = i + 1 + " из 43";
    

        
    getVariantA.value = arrA[i];
    getVariantB.value = arrB[i];
    }
    
}

function results() {
    document.getElementById('input').style.display='none';
    document.getElementById('infoID').style.paddingBottom='30px';
    for(j = 0; j < 43; j++){
        
        if(answer[j] == realType[j]){
            rt++;
        }
        
        if(answer[j] == intType[j]){
            it++;
        }
        
        if(answer[j] == socType[j]){
            st++;
        }
        
        if(answer[j] == konType[j]){
            kt++;
        }
        
        if(answer[j] == predType[j]){
            pt++;
        }
        
        if(answer[j] == artType[j]){
            at++;
        }

    }
        
        result_realType.innerHTML = "Реалистический тип: " + (rt*100/15).toFixed(2) + "%" + " (" + rt +"/15)";
        result_intType.innerHTML = "Интеллектуальный тип: " + (it*100/15).toFixed(2) + "%" + " (" + it +"/15)";
        result_socType.innerHTML = "Социальный тип: " + (st*100/15).toFixed(2) + "%" + " (" + st +"/15)";
        result_konType.innerHTML = "Конвенциальный тип: " + (kt*100/14).toFixed(2) + "%" + " (" + kt +"/15)";
        result_predType.innerHTML = "Предприимчивый тип: " + (pt*100/14).toFixed(2) + "%" + " (" + pt +"/15)";
        result_artType.innerHTML = "Артистичный тип: " + (at*100/13).toFixed(2) + "%" + " (" + at +"/15)";
        
        document.getElementById('default').style.display='block';

        
        result_rt.innerHTML = (rt*100/15).toFixed(2) + "%" + " (" + rt +"/15)";
        result_it.innerHTML = (it*100/15).toFixed(2) + "%" + " (" + it +"/15)";
        result_st.innerHTML = (st*100/15).toFixed(2) + "%" + " (" + st +"/15)";
        result_kt.innerHTML = (kt*100/14).toFixed(2) + "%" + " (" + kt +"/15)";
        result_pt.innerHTML = (pt*100/14).toFixed(2) + "%" + " (" + pt +"/15)";
        result_at.innerHTML = (at*100/13).toFixed(2) + "%" + " (" + at +"/15)";
    
    

}